     A*---------------------------------------------------------------
     A*  CARRIER 
     A*---------------------------------------------------------------
     A            WS_CARR1_NAME        30A
     A            WS_CARR1_TYPE        20A
     A            WS_CARR1_PLATFORM    20A
     A            WS_CARR1_SELECTED     1A
