     A*****************************************************************
     A* FILE : EMAILREQ_PF
     A* DESC : Email request header
     A*****************************************************************
     A          R EMAILREQR
     A            EMAIL_REQ_ID        15A
     A            EMAIL_TO            50A
     A            EMAIL_SUBJECT      100A
     A            EMAIL_BODY         500A
     A            EMAIL_STATUS        20A
