     A*****************************************************************
     A* FILE : VALIDATION_RES_PF
     A* DESC : Validation execution result
     A*****************************************************************
     A          R VALIDRESR
     A            FIELD_VALID_FLAG    1A
     A            ERROR_COUNT         3P 0
     A            WARNING_COUNT       3P 0
     A            VALIDATION_MESSAGE 200A
     A            SEVERITY_LEVEL      10A
